# Лабораторна робота №1
### Тема: Дослідження команд RISC та CISC
### Мета: Дослідити набори команд RISC та CISC, з’ясувати основні теоретичні відомості.
## Хід роботи
Діаграма порівняння RISK та CISK
| Основа для порівняння | RISK | CISK |
|-----------------------|------|------|
|Наголос (основа на чому базується)|Це архітектура процесорів зі скороченим набором команд, який базується на програмному забезпеченні|Це тип процесорної архітектури, який базується на устаткуванні|
|Розмір набору інструкцій|Малий|Великий|
|Формати інструкцій|Фіксований (32-бітний) формат|Змінні формати (16-64 біт кожної інструкції)|
|Використовуються режими адресації|Використовує один такт та режим обмеженної адресації (3-5)|Многократні режими адресації (12-24)|
|Використовуються регістри загального призначення|Кількість регістрів коливається від 32 до 192|8-24 регістрів|
|Висновки пам'яті|Зареєструйтеся для реєстрації|Пам'ять в пам'ять|
|Дизайн кешу|Роздільний кеш даних і кеш інструкцій|Єдиний кеш для інструкцій і даних|
|Тактова частота (типові)|50-150 МГц|33-50 МГц|
|Цикли на інструкцію|Єдиний цикл для всіх інструкцій і середній ІСЦ <1.5|ІСЦ між 2 і 15|
|Керування процесором|Обмотка без пам'яті управління|Мікрокодування з використанням керуючої пам'яті (ПЗУ)|

### Висновок
Поштовхом для розробки RISC архітектури стало те, що тогочасні (середина 1970-х) компілятори не використовували більшість команд із CISC набору та не могли скористатися перевагами багатьох типів складної адресації.
Виконання складних CISC інструкцій вимагало багатьох процесорних тактів, а реалізація різних типів адресування та інструкцій, що реалізовують високорівневі операції, займала більшість площі процесорного кристалу та майже не використовувалась.
RISC-процесори швидші і економічніші, ніж CISC.

### Контрольні питання
##### 1. Коротко охарактеризуйте набір команд RISC?
Набори команд зі зменшеними наборами команд (RISC), як правило, містять менше 100 інструкцій і використовують фіксований формат інструкцій (32 біта).
Він використовує кілька простих режимів адресації.
Використовуються інструкції на основі реєстру, що означає, що використовується механізм реєстрації для реєстрації.
LOAD / STORE - єдині незалежні інструкції для доступу до пам'яті. Для підвищення швидкості перемикання контекстів використовується великий файл реєстру.
Простота наборів команд призвела до реалізації цілих процесорів на одному чіпі VLSI. Додатковими перевагами є більш висока тактова частота, нижчий
ІСЦ, що регулюють високі рейтинги MIPS на наявних RISC/суперскалярних процесорах.

##### 2. Коротко охарактеризуйте набір команд CISC?
Комплекс команд набору команд (CISC) набір інструкцій містить близько 120 до 350 інструкцій.
Він використовує змінні формати інструкцій/даних, але невеликий набір регістрів загального призначення, тобто 8-24.
Причиною великих наборів команд є використання інструкцій змінного формату.
Велика кількість еталонних операцій пам'яті виконується за допомогою величезної кількості режимів адресації.
Архітектура CISC безпосередньо використовує оператори HLL в апаратних/прошивках.
Єдиний кеш використовується в традиційній архітектурі CISC, яка містить як дані, так і інструкції, і використовує загальний шлях.

##### 3. Дайте порівняння цих наборів команд.
![alt text](https://adnanonlineclass.net/wp-content/uploads/2019/12/Difference-between-RISC-and-CISC-1.jpg)
* У RISC розмір набору команд невеликий, а в CISC величина набору команд велика.
* RISC використовує фіксований формат (32 біта) і в основному регіональні інструкції, тоді як CISC використовує діапазон змінних форматів від 16-64 біт на інструкцію.
* RISC використовує один годинник і обмежений режим адресації (тобто 3-5). З іншого боку, CISC використовує декілька годин від 24 до 24 режимів адресації.
* Кількість регістрів загального призначення, які використовує RISC, коливається від 32-192. Навпаки, архітектура CISC використовує 8-24 GPR.
* Механізм реєстрації в регістр використовується в RISC з незалежними інструкціями LOAD і STORE. На відміну від цього, CISC використовує механізм пам'яті до пам'яті для виконання
операцій, крім того, включені інструкції LOAD і STORE.
* RISC має розділені дані та кеш керування інструкціями. На відміну від цього, CISC використовує уніфікований кеш для даних і інструкцій, хоча останні конструкції також використовують розділені кеші.
* Більшість елементів керування процесором в RISC є провідними без наявності пам'яті керування. І навпаки, CISC мікрокодується і використовує керуючу пам'ять (ROM), але сучасний CISC також використовує жорстке керування.
![alt text](https://i0.wp.com/itc.ua/wp-content/uploads/2013/03/CISC-RISC.jpg?quality=100&strip=all&ssl=1)
